<script>
  import LinkExternal from '../components/link-external.svelte';
</script>

<div
  class="flex flex-col space-y-8 md:space-y-12 px-4 mt-12 md:mt-24 w-full max-w-4xl mx-auto"
>
  <div class="space-y-4 md:space-y-6">
    <h1 class="text-h3 font-bold text-center">เกี่ยวกับโครงการ</h1>

    <p>
      “สภาร่างรัฐธรรมนูญ”
      คือสภาที่ประกอบไปด้วยกลุ่มบุคคลซึ่งเกิดขึ้นมาเพื่อทำหน้าที่ร่างรัฐธรรมนูญ
      มักเกิดขึ้นภายหลังการประกาศใช้รัฐธรรมนูญฉบับชั่วคราวแล้วเกิดความต้องการให้มีรัฐธรรมนูญฉบับถาวรทดแทน
      โดยสมาชิกสภาร่างรัฐธรรมนูญแต่ละชุดก็มีรายละเอียดปลีกย่อยและจุดเด่นที่แตกต่างกันออกไป
    </p>
    <p>
      นับตั้งแต่การเปลี่ยนแปลงการปกครองจากระบอบสมบูรณาญาสิทธิราชย์มาเป็นประชาธิปไตยอันมีพระมหากษัตริย์ทรงเป็นประมุข
      ประเทศไทยมีสภาร่างรัฐธรรมนูญเกิดขึ้นเพื่อมาร่างรัฐธรรมนูญแล้วจำนวนทั้งสิ้น
      4 ชุด ได้แก่ สภาร่างรัฐธรรมนูญ พ.ศ. 2491 สภาร่างรัฐธรรมนูญ พ.ศ. 2502
      สภาร่างรัฐธรรมนูญ พ.ศ. 2539 และสภาร่างรัฐธรรมนูญ พ.ศ. 2550
    </p>
    <p>
      แม้สภาร่างรัฐธรรมนูญจะถือเป็นหนึ่งกลไกที่มีบทบาทสำคัญเพื่อการร่างรัฐธรรมนูญในประวัติศาสตร์การเมืองไทย
      แต่เมื่อหากพิจารณาจากรายละเอียดต่าง ๆ เช่น ที่มา โครงสร้าง
      หรือผลการทำงานของสมาชิกสภาร่างรัฐธรรมนูญทั้ง 4 ชุด
      ก็จะเห็นว่ายังมีปัญหาอยู่หลายประการ เช่น
      ปัญหาเรื่องการมีส่วนร่วมของประชาชนทุกคนทุกกลุ่มในการร่างรัฐธรรมนูญอย่างเท่าเทียมและเสมอภาค
      ปัญหาเรื่องความมั่นคงต่อเนื่องของรัฐธรรมนูญที่ถูกร่างโดยสภาร่างรัฐธรรมนูญ
      เป็นต้น
    </p>
    <p>
      ELECT ขอพาทุกคนทำความรู้จักรายละเอียดเกี่ยวกับสมาชิกสภาร่างรัฐธรรมนูญทั้ง
      4 ชุด ในประเทศไทย ผ่าน “10 หัวข้อที่น่าสนใจเกี่ยวกับ สสร.”
      เพื่อให้ทุกคนได้ร่วมกันคิดว่า
      หากในอนาคตจะต้องมีการใช้กลไกนี้ในการร่างรัฐธรรมนูญขึ้นอีกเป็นครั้งที่ 5
      เราจะออกแบบสภาร่างรัฐธรรมนูญให้ประชาชนสามารถเข้าไปมีส่วนร่วมได้อย่างเต็มที่
      เพื่อให้การร่างรัฐธรรมนูญเป็นของประชาชนและประสบความสำเร็จอย่างแท้จริงได้อย่างไร
    </p>
  </div>

  <div class="space-y-4 md:space-y-6">
    <h2 class="text-h4 font-bold">ที่มาของข้อมูล</h2>

    <ul class="list-inside list-disc">
      <li>
        <LinkExternal
          href="https://library2.parliament.go.th/ebook/content-ebbas/2561-anucha.pdf"
          >เอกสาร “สภาร่างรัฐธรรมนูญไทย” ของกลุ่มงานห้องสมุด สำนักวิชาการ
          สำนักงานเลขาธิการสภาผู้แทนราษฎร
        </LinkExternal>
      </li>
      <li>
        <LinkExternal
          href="http://wiki.kpi.ac.th/index.php?title=สภาร่างรัฐธรรมนูญ#cite_note-4"
          >บทความ “สภาร่างรัฐธรรมนูญ” จากเว็บไซต์ฐานข้อมูลการเมืองการปกครอง
          สถาบันพระปกเกล้า
        </LinkExternal>
      </li>
      <li>
        <LinkExternal
          href="https://th.wikipedia.org/wiki/สภาร่างรัฐธรรมนูญ_(ประเทศไทย)"
          >บทความ “สภาร่างรัฐธรรมนูญ (ประเทศไทย)” จากเว็บไซต์วิกิพีเดีย
        </LinkExternal>
      </li>
    </ul>
  </div>

  <div class="space-y-4 md:space-y-6">
    <h2 class="text-h4 font-bold">อาสาสมัครร่วมพัฒนา</h2>
    <div class="space-y-2">
      <p class="font-bold">เขียนโปรแกรม 👩‍💻</p>
      <p>
        <LinkExternal href="https://github.com/Th1nkK1D">Th1nkK1D</LinkExternal
        >,
        <LinkExternal href="https://github.com/thasarito"
          >thasarito</LinkExternal
        >
      </p>
    </div>
    <div class="space-y-2">
      <p class="font-bold">ออกแบบ 👩‍🎨</p>
      <p>ชาญ แสงวิโรจน์กุล</p>
    </div>
    <div class="space-y-2">
      <p class="font-bold">สืบค้นและรวบรวมข้อมูล 🕵️‍♀️</p>
      <p>สิทธิกานต์ ธีระวัฒนชัย</p>
    </div>
    <div class="space-y-2">
      <p class="font-bold">บรรณาธิการ 👩‍🍳</p>
      <p>ธนิสรา เรืองเดช</p>
    </div>
    <div class="space-y-2">
      <p class="font-bold">ประสานงานและจัดการอื่น ๆ 🧙‍♀️</p>
      <p>
        <LinkExternal href="https://punchup.world/">Punch Up</LinkExternal>,
        <LinkExternal href="https://www.boonmeelab.com/"
          >Boonmee Lab</LinkExternal
        >
      </p>
    </div>
  </div>

  <div class="space-y-4 md:space-y-6">
    <h2 class="text-h4 font-bold">ร่วมพัฒนาโครงการ</h2>
    <p>
      ตรวจสอบ ติดตาม และร่วมพัฒนาโปรเจ็กท์ได้ทาง Github
      โค้ดบนเว็บไซต์ทั้งหมดถูกเปิดเผยแบบสาธารณะเพื่อความโปร่งใสในการดำเนินการและพัฒนา
      และร่วมเป็นส่วนหนึ่งในการพัฒนา Civil Tech ในประเทศไทย
      หากคุณต้องการแบ่งปันทักษะด้านพัฒนาระบบ ออกแบบ รวบรวมข้อมูล
      หรือแบ่งปันข้อมูล รวมทั้งความช่วยเหลือด้านอื่น ๆ สามารถติดต่อได้ที่
      contact [at] elect.in.th
    </p>
  </div>

  <div class="flex justify-center">
    <a
      href="/#"
      target="_blank"
      rel="noopener noreferrer"
      class="text-white bg-black rounded px-4 py-2">ดาวโหลดข้อมูล</a
    >
  </div>
</div>
