<script>
  import GoldenFrame from './golden-frame.svelte';
</script>

<div class="landing-detail flex px-1 -mx-3 md:-mx-8">
  <GoldenFrame class="transform -translate-y-1/3">
    <p>
      รายละเอียดน่าสนใจเกี่ยวกับสมาชิกสภาร่างรัฐธรรมนูญทั้ง 4
      ชุดในประวัติศาสตร์การเมืองไทย แสดงเห็นให้ว่า
    </p>
    <p>
      "การทำให้สภาร่างรัฐธรรมนูญเป็นกลไกทางประชาธิปไตยที่สามารถให้ประชาชนเข้าไปมีส่วนร่วมได้เต็มที่และทั่วถึง
      เพื่อทำให้เกิดการร่างรัฐธรรมนูญที่คงทนถาวรและเป็นของประชาชนอย่างแท้จริง
      ยังคงเป็นโจทย์ใหญ่ที่สังคมไทยต้องร่วมกันขบคิดต่อไป"
    </p>
  </GoldenFrame>
</div>

<style>
  div {
    background: linear-gradient(
      180deg,
      rgba(201, 191, 138, 0.4) 0%,
      rgba(201, 191, 138, 0) 100%
    );
  }
</style>
